#### Import Libraries

In [1]:
# library for data analysis
import pandas as pd

# library for visualizations
import matplotlib.pyplot as plt

# library for connecting to databases 
import sqlite3

#### Connect To A Database

In [2]:
# connecting to the database
conn = sqlite3.connect('database.sqlite')

# making a cursor object
c = conn.cursor()

#### Execute Queries

In [4]:
# execute command can take any query and execute it
c.execute('select * from city')

# no data is fetched until we call fetchall() method
data = c.fetchall()

for row in data:
    print(row)

(1, 'Bangalore', 1)
(2, 'Chandigarh', 1)
(3, 'Delhi', 1)
(4, 'Mumbai', 1)
(5, 'Kolkata', 1)
(6, 'Jaipur', 1)
(7, 'Hyderabad', 1)
(8, 'Chennai', 1)
(9, 'Cape Town', 2)
(10, 'Port Elizabeth', 2)
(11, 'Durban', 2)
(12, 'Centurion', 2)
(13, 'East London', 2)
(14, 'Johannesburg', 2)
(15, 'Kimberley', 2)
(16, 'Bloemfontein', 2)
(17, 'Ahmedabad', 1)
(18, 'Cuttack', 1)
(19, 'Nagpur', 1)
(20, 'Dharamsala', 1)
(21, 'Kochi', 1)
(22, 'Indore', 1)
(23, 'Visakhapatnam', 1)
(24, 'Pune', 1)
(25, 'Raipur', 1)
(26, 'Ranchi', 1)
(27, 'Abu Dhabi', 3)
(28, 'Rajkot', 1)
(29, 'Kanpur', 1)

#### Convert to a Pandas Dataframe

In [10]:
# read_sql_query() takes a query and converts the output to pandas dataframe
df = pd.read_sql_query('select * from city', conn )

# printing the contents of dataframe
print( type(df) )
df.head()

<class 'pandas.core.frame.DataFrame'>

   City_Id   City_Name  Country_id
0        1   Bangalore           1
1        2  Chandigarh           1
2        3       Delhi           1
3        4      Mumbai           1
4        5     Kolkata           1

In [11]:
# closing the connection at the end
conn.close()